###########################################################################
#
# Tap brew
#
###########################################################################
# Updated Grep
brew tap homebrew/dupes

# Caskroom fonts
brew tap caskroom/fonts

# powerlevel10k
brew tap romkatv/powerlevel10k

###########################################################################
#
# brew install
#
###########################################################################
# Zsh is a shell designed for interactive use.
# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'
# Zsh is a shell designed for interactive use.
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
# Version control
brew 'git'
brew 'python3'
brew 'ssh-copy-id'
# command line editor
brew 'vim'
# m-cli is a macOS command line tool that lets you interact with utilities
brew 'm-cli'
# A simple command line interface for the Mac App Store
brew 'mas'
# ctop is a top-like interface for container metrics
brew 'ctop'
# GNU grep, egrep and fgrep
brew 'grep'
# jq is a lightweigt json processor
brew 'jq'
#Tools and libraries to manipulate images in many formats
brew 'imagemagick'
# Archey is a simple system information tool
brew 'archey'
# Emacs dependency management
brew 'cask'
# Manage multiple Node.js versions
brew 'nvm'
# Display directories as trees (with optional color/HTML output)
brew 'tree'
# Keep your Mac's application settings in sync
brew 'mackup'
brew 'powerlevel10k'
# Python version management
brew 'pyenv'
# JavaScript package manager
brew 'yarn'
# Perl lib for reading and writing EXIF metadata
brew 'exiftool'
# Monitors computer mic and webcam
brew 'oversight'
# Clone of cat with syntax highlighting and Git integration
brew 'bat'
# Fast, highly customisable system info script
brew 'neofetch'

# Automake is a tool for automatically generating Makefile installation files.
brew 'automake'

brew 'ruby'

##
# Some GNU command line tools already exist by default on OS X.
# We choose to replace these with newer versions.
##

brew 'gpatch'
brew 'm4'
brew 'make'
brew 'nano'


###########################################################################
#
# cask install
#
###########################################################################
cask 'google-chrome'
cask 'iterm2'
cask 'firefox'
cask 'spotify'
cask 'docker'
cask '1password'
cask 'rambox'
cask 'rocket-chat'
cask 'tor-browser'
cask 'visual-studio-code'
cask 'android-studio'
cask 'brave-browser'
cask 'android-platform-tools'
cask 'handbrake'
cask 'fork'
cask 'postman'
cask 'proxyman'
cask 'openmtp'
cask 'sqlpro-for-sqlite'
cask 'cyberduck'
cask 'keka'
cask 'sequel-ace'
cask 'vlc'
cask 'java'
#Tools for building Android applications
cask 'android-studio'
# Android SDK component
cask 'android-platform-tools'


###########################################################################
#
# Install apps from app store using mas
#
###########################################################################
mas install 1352778147 # Bitwarden
mas install 497799835 # XCode
mas install 1451685025 # Wireguard
mas install 585829637 # Todoist