#Set cask install path 
cask_args appdir: "/Applications"

###########################################################################
#
# brew install
#
###########################################################################
# Zsh is a shell designed for interactive use.
# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'
# Zsh is a shell designed for interactive use.
brew 'zsh'
# Version control
brew 'git'
brew 'python3'
# command line editor
brew 'vim'
# m-cli is a macOS command line tool that lets you interact with utilities
brew 'm-cli'
# A simple command line interface for the Mac App Store
brew 'mas'
# ctop is a top-like interface for container metrics
brew 'ctop'
# GNU grep, egrep and fgrep
brew 'grep'
# jq is a lightweigt json processor
brew 'jq'
#Tools and libraries to manipulate images in many formats
brew 'imagemagick'
# Archey is a simple system information tool
brew 'archey'
# Emacs dependency management
brew 'cask'
# Manage multiple Node.js versions
brew 'nvm'
# Display directories as trees (with optional color/HTML output)
brew 'tree'
# Keep your Mac's application settings in sync
brew 'mackup'
# Python version management
brew 'pyenv'
# JavaScript package manager
brew 'yarn'
# Perl lib for reading and writing EXIF metadata
brew 'exiftool'
# Clone of cat with syntax highlighting and Git integration
brew 'bat'
# Fast, highly customisable system info script
brew 'neofetch'
# Automake is a tool for automatically generating Makefile installation files.
brew 'automake'
# Powerful, clean, object-oriented scripting language
brew 'ruby'
# Upgrade all the things
brew 'topgrade'
##
# Some GNU command line tools already exist by default on OS X.
# We choose to replace these with newer versions.
##
brew 'gpatch'
brew 'm4'
brew 'make'
brew 'nano'
brew 'yq'
# Password generator
brew 'pwgen'


###########################################################################
#
# cask install
#
###########################################################################
cask 'google-chrome'
cask 'iterm2'
cask 'firefox'
cask 'spotify'
cask 'docker'
cask 'tor-browser'
cask 'visual-studio-code'
cask 'android-studio'
cask 'brave-browser'
cask 'android-platform-tools'
cask 'handbrake'
cask 'fork'
cask 'postman'
cask 'proxyman'
cask 'openmtp'
cask 'sqlpro-for-sqlite'
cask 'cyberduck'
cask 'keka'
cask 'sequel-ace'
cask 'vlc'
#Tools for building Android applications
cask 'android-studio'
# Android SDK component
cask 'android-platform-tools'
# Monitors computer mic and webcam
cask 'oversight'
# Move and resize windows using keyboard shortcuts or snap areas
cask 'rectangle'
# Virtual machines UI using QEMU
cask 'utm'
# Finds duplicate files in a computer system
cask 'dupeguru'
# Open-source screen recorder built with web technology
cask 'kap'
# Meet, chat, call, and collaborate in just one place
cask 'microsoft-teams'
# Desktop password and login vault
cask 'bitwarden'
# Web browser
cask 'waterfox'
# Imaging utility to install operating systems to a microSD card
cask 'raspberry-pi-imager'
# Instant messaging application focusing on security
cask 'signal'
# Desktop client for Telegram messenger
cask 'telegram-desktop'
# Tool to control external monitor brightness & volume
cask 'monitorcontrol'
# Open-source video transcoder
cask 'handbrake'
# Free and open-source page layout program
cask 'topgrade'
# Note taking and to-do application with synchronization capabilities
cask 'joplin'

###########################################################################
#
# Install apps from app store using mas
#
###########################################################################
mas "Bitwarden", id: 1352778147 # Bitwarden
mas "Wireguard", id: 1451685025 # Wireguard
mas "Todoist", id: 585829637 # Todoist
mas "Xcode", id: 497799835 # XCode